from func import meet

def zastavka():
    meet()


    print("""
                Курсовая работа на тему решение матрчиных уравнений методом обратной матрицы
                """)

    print("""
          
          
            Выберите подходящий тип уравнения
                        1)A*X=B
                        X=A^(-1) * B
                                

                        2)X*A = B
                        X = B*A^(-1)
                                    
                                
                        3)A*X*C = B
                        X = A^(-1)*B*C^(-1)
          
            Введите 4, если хотите выйти из программы
                """)